# Инструкция по работе с Git

## Установка Git
1. [Скачайте](https://git-scm.com/downloads) и установите Git.

## Создание репозитория
1. Откройте терминал.
2. Перейдите в папку проекта: `cd путь/к/папке/проекта`
3. Инициализируйте репозиторий: `git init`

## Основные команды
- `git add файл` - добавить файлы в индекс.
- `git commit -m "Ваш комментарий"` - создать коммит с сообщением.
- `git status` - проверить статус изменений.
- `git log` - просмотреть историю коммитов.

## Ветки
1. `git branch` - просмотреть список веток.
2. `git branch новая_ветка` - создать новую ветку.
3. `git checkout ветка` - переключиться на другую ветку.
4. `git merge ветка` - слить изменения из другой ветки.

## Разрешение конфликтов
1. Создайте конфликт внесением изменений в одном файле в разных ветках.
2. Воспользуйтесь командой `git merge` для слияния веток.
3. При возникновении конфликта, редактируйте файл и сохраните изменения.
4. Добавьте изменения в индекс: `git add файл`.
5. Завершите процесс слияния: `git merge --continue`.

## Загрузка изменений
1. `git remote add origin ссылка_на_репозиторий` - добавить удаленный репозиторий.
2. `git push -u origin мастер` - отправить изменения на сервер.

## Работа с удаленным репозиторием
1. `git clone ссылка_на_репозиторий` - клонировать репозиторий.
2. `git pull origin мастер` - загрузить изменения из удаленного репозитория.
